# Lambda Function

In [2]:
def abc(x):
    
    output=x*2
    return output

In [3]:
abc(2)

4

In [4]:
abc=lambda x:x*2

print(abc(2))

4

In [5]:
list_1=[1,2,3,4,5,6,7,8,9]

list(filter(lambda x: x%2==0, list_1))

[2, 4, 6, 8]

In [7]:
list_1=[1,2,3,4,5,6,7,8,9]

cubed=map(lambda x: pow(x,2), list_1)
list(cubed)

[1, 4, 9, 16, 25, 36, 49, 64, 81]

#

In [1]:
import pandas as pd
df=pd.DataFrame({
    'Name':['Luke','Gina','Sam','Emma'],
    'Status':['Father','Mother','Son','Daughter'],
    'Birthyear':[1976,1984,2013,2016],})
df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

In [6]:
df=pd.DataFrame(df,index=[1,2,3,4])
df
df.reindex([2,1,3,4])

   Name    Status  Birthyear
2   Sam       Son     2013.0
1  Gina    Mother     1984.0
3  Emma  Daughter     2016.0
4   NaN       NaN        NaN

In [7]:
df.sort_values(by='Birthyear')

   Name    Status  Birthyear
1  Gina    Mother     1984.0
2   Sam       Son     2013.0
3  Emma  Daughter     2016.0
4   NaN       NaN        NaN

In [9]:
df['age']=df['Birthyear'].apply(lambda x: 2022-x)
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   46
1  Gina    Mother       1984   38
2   Sam       Son       2013    9
3  Emma  Daughter       2016    6

In [10]:
list(filter(lambda x: x>18, df['age']))

[46, 38]

In [11]:
df['double_age']=df['age'].map(lambda x: x*2)
df

   Name    Status  Birthyear  age  double_age
0  Luke    Father       1976   46          92
1  Gina    Mother       1984   38          76
2   Sam       Son       2013    9          18
3  Emma  Daughter       2016    6          12

In [12]:
df['Gender']=df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   46          92    Male
1  Gina    Mother       1984   38          76  Female
2   Sam       Son       2013    9          18    Male
3  Emma  Daughter       2016    6          12  Female

In [13]:
df[['Name','Status']]=df.apply(lambda x: x[['Name', 'Status']].str.lower(),axis=1)

df

   Name    Status  Birthyear  age  double_age  Gender
0  luke    father       1976   46          92    Male
1  gina    mother       1984   38          76  Female
2   sam       son       2013    9          18    Male
3  emma  daughter       2016    6          12  Female